// Два игрока по очереди ставят крестики или нолики
// на игровом поле, нажимая клавиши цифровой клавиатуры,
// соответствующие ячейкам игрового поля. 
// Выигрывает тот кто первым заполнит своими знаками
// вертикальную, горизонтальную или диагональную линию.

//          _________________
//         |     |     |     |
//         |  7  |  8  |  9  |
//         |_____|_____|_____|
//         |     |     |     |
//         |  4  |  5  |  6  |
//         |_____|_____|_____|
//         |     |     |     |
//         |  1  |  2  |  3  |
//         |_____|_____|_____|

